sim_inputs/pitzDaily_ML/Allrun
#!/bin/sh

cd ${0%/*} || exit 1    # Run from this directory

source /path/to/openfoam/etc/bashrc

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=`getApplication`

cp -r 0.orig 0 > /dev/null 2>&1
runApplication simpleFoam_ML

#------------------------------------------------------------------------------
