sim_inputs/pitzDaily_ML/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam_ML;

startFrom       startTime; //startTime;

startTime       0;

stopAt          endTime;

endTime         10000;

deltaT          1;

writeControl    timeStep;

writeInterval  	100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

graphFormat     raw;

functions
{
   // #includeFunc "stressComponents"
   // #includeFunc "pressureCoefficient"
   // #includeFunc "sample"
   // #includeFunc "sampleCp"
   // #includeFunc "writeCellCentres"
   // #includeFunc "wallShearStress"
}

libs
(
  "/path/to/openfoam/user/directory/lib/ML_SA_CG.so"
);



// ************************************************************************* //
